import { CYR_SMALL, LAT_SMALL, initShiftAlphabet, crypt } from './caesar.js';

document.addEventListener('DOMContentLoaded', () => {
	const TAI_IN = document.getElementById('textareaI_IN');
	const TAI_OUT = document.getElementById('textareaI_OUT');
	const KEYI = document.getElementById('inputI_KEY');
	const TAII_IN = document.getElementById('textareaII_IN');
	const TAII_OUT = document.getElementById('textareaII_OUT');
	const KEYII = document.getElementById('inputII_KEY');

	document.querySelectorAll('.insert-text-link').forEach(link => {
		link.addEventListener('click', (event) => {
			event.preventDefault()

			switch (link.id) {
				case 'insertCYR':
					TAI_IN.value = CYR_SMALL;
					KEYI.value = 0;
					crypt(TAI_IN, TAI_OUT, initShiftAlphabet(KEYI.value));
					break;

				case "insertLAT":
					TAI_IN.value = LAT_SMALL;
					KEYI.value = 0;
					crypt(TAI_IN, TAI_OUT, initShiftAlphabet(KEYI.value));
					break;

				case "insertShifr":
					TAII_IN.value = link.textContent;
					KEYII.value = 0;
					crypt(TAII_IN, TAII_OUT, initShiftAlphabet(-KEYII.value));
					break;

				// case "#big-text":
				// 	text_in3.value = big_text;
				// 	key3.value = 0;
				// 	initShiftAlphabet(key3.value);
				// 	crypt(text_in3, text_out3);
				// 	buildHist(text_out3.value);
				// 	break;

				default:
					break;
			}
		})
  });
})

//   let big_text =
//     "Кж, кж, ё тлфпивр, цхдщхуъ цчхшщх иоёт шихр нл щлсшщ.  Дщъ поилшщфъе эпщжщъ ив фжилчфёсж штвяжтп фп хкпф чжо... Цхшщхрщл, съкж нл ив, фл ъьхкпщл, дщх цчжикж лйх эпщжщж, цчхшщх хфж ожяпычхижфж, п фж цлчивр иойтёк сжнлщшё, ющх дщх злшшувштлффвр фжзхч зъси. Фх ив ъкпипщлшг, фжшсхтгсх цчхшщх ухнфх лйх чжшяпычхижщг – кхшщжщхюфх тпяг офжщг жтйхчпщу япычхижфпё.  Фжилчфхл фънфх шклтжщг флзхтгяхл хщшщъцтлфпл ктё щль, сщх 'фл и щлул' п иххзал фпсхйкж фл штвяжт цчх счпцщхйчжыпе, япычщлсшщв, стеюп п кчъйп шщчжффвл штхилюсп. Пфыхчужэпё ишлйкж ижнфлряпу ыжсщхчху фж цчхщёнлфпп ишлр пшщхчпп юлтхилюлшщиж, фжцчпулч, ъофжи юпштлффхшщг ичжнлшсхйх ихршсж п йкл чжоулалфв лйх хщчёкв, хцвщфвр цхтсхихклэ зло щчъкж шухнлщ цчпкъужщг щжсщпсъ п чжозпщг жчупе ичжйж. Птп, фжцчпулч, ижу цх шлсчлщъ шсжожтп, ющх юлчло флшсхтгсх кфлр фжюфмщшё чжшцчхкжнж звщхихр щльфпсп ш зхтгяпуп шспксжуп, п ив щлцлчг шщжтп фхшпщлтлу шхсчхилффхр щжрфв п чжкълщлшг, ющх хсжнлщлшг и юпштл флуфхйпь шюжшщтпиюпсхи, сщх ъчимщ шлзл клямиъе шщпчжтсъ. Ш кчлифпь ичлумф цхилтхшг цхшвтжщг йхфэхи по хкфхйх улшщж и кчъйхл, ющхзв цлчлкжщг дщъ ижнфъе пфыхчужэпе. Ичлуё ятх, йхфэв ънл кжифх хщцчжитлфв фж шижтсъ пшщхчпп, илкг цхёиптшё пфщлчфлщ п цчхщхсхтв цлчлкжюп пфыхчужэпп, фх фж шжуху клтл, цлчльижщпщг пфыхчужэпе ишм щжс нл цчхшщх.  П ш щль нл кчлифпь ичлумф текп ожкъужтпшг, ж сжс зв дщъ пфыхчужэпе цлчлкжщг щжс, ющхзв 'шихп' шухйтп лм цчхюлшщг п съцпщг цжчъ зпщсхрфхи цх ивйхкфхр элфл, ж 'юънпл', кжнл лштп цлчльижщёщ йхфэж, ъипкёщ иулшщх шххзалфпё флцхфёщфъе уляжфпфъ п, цхсчъщпи цжтгэлу ъ ипшсж, хщцъшщёщ йхфэж иулшщл ш дщхр лчъфкхр (схфлюфх, йхфэъ сжщлйхчпюлшсп флтгоё шххзажщг, ющх шхклчнпщшё и шххзалфпп п сжс иотхужщг япыч). Ъкхзфх, шхйтжшпщлшг? Ихщ щжс п ихофпстп счпцщхйчжыпё п счпцщхжфжтпо – фжъсп х щху, сжс шсчвщг щх, ющх хщсчвщх, п хщсчвщг щх, ющх шсчвщх.  Щжс ихщ, ихоичжажёшг с фжялуъ йлчхе - Эложчг, сжс ув ънл офжлу, звт фл къчжс, п фжпзхтлл элффвл шилклфпё, фжцчпулч, х цхтхнлфпп ичжнлшспь ихршс, цлчлшвтжт шихпу йлфлчжтжу пулффх и ожяпычхижффху ипкл цчп цхухап хшхзхйх япычж. П ьхщг и кжтгфлрялу ув цхсжнлу, ющх дщхщ япыч иотхужщг шлрюжш ухнлщ кжнл члзмфхс, фх и щл ичлулфж текп (цх зхтгялр южшщп) цхфёщпё фл пултп х сжспь-щх щжу япычжь, кж п иххзал звтп злойчжухщфв. Лам цхуфпщл х эпщжщл? Цх-цчлнфлуъ фпсжспь пклр? Щжс кжижрщл нл чжшшухщчпу улщхк, схщхчвр ихямт и пшщхчпе цхк фжоижфплу улщхкж япычхижфпё Эложчё, ёчсхйх цчлкшщжипщлтё япычж цчхшщхр ожулфв.";
