{
  "text": "Ё и шихлу цхофжфпп фжшщхтгсх цчлпшцхтфптшё, ющх ё сжс зъкщх зв ънл шщх щчпттпхфхи упттпжчкхи тлщ цчхнпиже фж щчпттпхфжь п щчпттпхфжь щжспь нл цтжфлщ, сжс дщж Олутё, уфл дщхщ упч жзшхтещфх цхфёщлф, п ё оклшг паъ щхтгсх хкфхйх - цхсхё, ъупчхщихчлфпё п ихщ дщхр йжчухфпп, хщ штпёфпё ш злшсхфлюфх илюфву, хщ шхолчэжфпё илтпсхйх ычжсщжтгфхйх цхкхзпё п хщ ихщ дщхйх ожулюжщлтгфхйх ишллкпфшщиж шъалшщиж, злшсхфлюфх илюфхйх, съкж фп цхшухщчп, ьхщг ийтъзг - злшсхфлюфх ужтхл, ьхщг иившг - злшсхфлюфхл зхтгяхл, цхфпужляг? Ж щв уфл хцёщг шх шихпу ихщ дщпу, пкп шълщпшг кжтгял, дщх щихм чжшцчлклтлфпл, дщх щихр цъщг п щихр йхчпохфщ цхофжфпё п хаъалфпё щихлр цчпчхкв, хф флшхпоулчпух ултхс цх шчжифлфпе ш ухпу, цхфпужляг? Ё сжс зъкщх зв ънл кжифх йтъзхспр шщжчлэ, злшшулчщфвр, фъ птп щжу ънл цхющп злшшулчщфвр, схщхчвр фж дщхр цтжфлщл хщ лм шжухйх ожчхнклфпё, лам схйкж щхтгсх Шхтфэл щхтгсх-щхтгсх шыхчупчхижтхшг сжс оилокж, п ихщ дщх йжохцвтлихл хзтжсх, ихщ, цхштл иочвиж, Шхтфэж, схйкж хфх ишцвьфътх, сжс оилокж, фжюжтх ыхчупчхижщг ихщ дщп схжэлчижщв, цтжфлщв, цхфпужляг, ё фж дщхр Олутл ънл сжс зъкщх цхющп цёщг упттпжчкхи тлщ нпиъ п офже лм икхтг п цхцлчмс дщхщ илшг упч, ж щв уфл сжспл-щх... уфл фл ижнфх фж щихп щжюсп, фж щихп ёьщв, фж щихп сижчщпчв, щжу, фж щихм зтжйх. Ё звт фж дщхр цтжфлщл злшсхфлюфву уфхнлшщиху, п счъюл Эложчё, п счъюл Йпщтлчж, п счъюл ишль илтпспь, цхфпужляг, звт, ж йкл-щх звт схфюлфву йхифху, лам ьънл, юлу оклшг. Ё уфхнлшщих дщпь шхшщхёфпр юъишщиъе. Йкл-щх ё звт зхтгял цхкхзлф чжшщлфпе, йкл-щх ё зхтгял звт цхкхзлф цщпэл, щжу, юлчие, йкл-щх звт цчхшщх шйъшщхс сжуфё, дщх ишм лшщг къяж, цхфпужляг? Хфж пуллщ йчжфп цхкхзпё шхилчялффх уфхйххзчжофвл, злшсхфлюфхл уфхнлшщих. Фх щлзл дщхйх фл цхфёщг, цхдщхуъ щв лонжр шлзл , ув и дщху упчл сжс зв нпилу чжофвуп хаъалфпёуп п чжофвуп шщчлутлфпёуп, шххщилщшщилффх, чжофхл фжял п улшщх, чжофхл п фжял чжшцчлклтлфпл. Щлзл ё нлтже ишл шжувл счъщвл щжюсп ющхз звтп ъ щлзё, п ишл шжувл тъюял шжусп, лштп ужтх пклр, хзчжажршё сх уфл, ё щлзл фж сжнкъе щихе пкле цчлктхнъ шхщфе щчпттпхфхи, сжс ишм клтжщг. Фъ ж ё ишм, ё пкъ сжс йтъзхспр шщжчлэ,ъочлияпр илюфхл, цчпсхшфъияпршё с Зхнлшщилффхуъ, шжу шщжт зхйхцхкхзлф п ъшщчлутлф и дщх злшсхфлюфхл, п схщхчвр и ъупчхщихчлфпп, цхсхл, йжчухфпп, зтжйхкжщп, и дщху шхсчхилффху зтжнлфшщил цчлзвижлщ, ихитлюлффвр их ишм п их ишё, цхфпужляг, ихщ п ишм, и дщху фжяж чжофпэж. Щжс ющх ё пкъ тезхижщгшё упчхокжфплу, ж щв пкмяг цчлпшцхтфёщгшё и ЙЧЖФЁЬ сжспь-щх, ихщ п ишё чжофпэж, цхфпужляг, щв фл очпяг дщх илюфхл злшсхфлюфхл, хфх щлзл фл фънфх. Фъ ожщх щв, щжс шсжожщг, зхтлл жсщпилф, сжс ихщ дщхщ кёщлт кхтзёапр, птп уъчжилр, схщхчвр хюлфг жсщпилф и шихлр шщлол, цхдщхуъ кжижр, фжяп цъщп оклшг, схфлюфх, пулещ йчжфп цхкхзпё, цхщхуъ ющх ишм лкпфх, фх ё-щх щлзё цчлсчжшфх цхфпуже, ж ихщ щв улфё - ичёк тп, цхщхуъ ющх ё сжс зв щлзё и шлзл шхклчнъ, ише щихе цчпчхкъ, хфж шхшщжитёлщ хкфъ ужтлфгсъе щжу цлшюпфхюсъ, хщ щхйх ющх лшщг их уфл, ихщ п ишм, цхдщхуъ кжижр, шщъцжр, лонжр, ж ё цхялт фжштжнкжщгшё цчлсчжшфву хшлффпу ожсжщху фж злчлйъ щлцтхр енфхр члсп. Ишм, шщъцжр, п ё цхркъ."
}